app/views/tasks/_form.html.erb

<div class="dropdown">
<%= f.collection_select(:category_id, Category.all, :id, :name, {}, {:class=>'form-control'}) %>
---
SELECT "categories".* FROM "categories"

<%= f.label :priority_id, "Priority" %>
<%= f.collection_select(:priority_id, Priority.all, :id, :name, {}, {:class=>'form-control'}) %>
---
SELECT "priorities".* FROM "priorities"