app/controllers/tasks_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."priority_id" = ?  [["priority_id", 1]]
SELECT "tasks".* FROM "tasks"
SELECT COUNT(*) FROM "tasks"
---
  def index
    @categories = Category.all

    if params[:keyword]
      @tasks = Task.where( [ "name like ?", "%#{params[:keyword]}%" ] ).page(params[:page]).per(5)
      @Page_title = "Search: " + params[:keyword]
    else
      case params[:status]
      when 'finished'
        @tasks = Task.where(is_finished: TRUE).page(params[:page]).per(5)
        @Page_title = "To-do List: Finished"
      when 'unfinish'
        @tasks = Task.where(is_finished: FALSE).page(params[:page]).per(5)
        @Page_title = "To-do List: Unfinish"
      when 'high-priority'
        @tasks = Task.where(priority_id: 1).page(params[:page]).per(5)
        @Page_title = "To-do List: High Priority"
      when 'normal-priority'
        @tasks = Task.where(priority_id: 2).page(params[:page]).per(5)
        @Page_title = "To-do List: Normal Priority"
      when 'low-priority'
        @tasks = Task.where(priority_id: 3).page(params[:page]).per(5)
        @Page_title = "To-do List: Low Priority"
      else
        @tasks = Task.page(params[:page]).per(5)

INSERT INTO "tasks" ("name", "description", "priority_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "aaa"], ["description", ""], ["priority_id", 1], ["category_id", 1], ["created_at", "2016-04-06 07:44:15.642443"], ["updated_at", "2016-04-06 07:44:15.642443"]]
---
  def create
    @task = Task.new(task_params)
    @task.is_finished = false
    if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "qqqqqqqq"], ["updated_at", "2019-05-15 11:45:37.449236"], ["id", 1]]
---
  def update
    if @task.update(task_params)