app/controllers/tasks_controller.rb

  def create
    @categories = Category.all
    @tasks = Task.all
    @task = Task.create(task_params)
    @task.is_finished = false
    respond_to do |format|
      if @task.save
---
SELECT "tasks".* FROM "tasks"
UPDATE "tasks" SET "is_finished" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_finished", "f"], ["updated_at", "2016-04-06 07:44:15.666694"], ["id", 1]]